# VertexStreamPositionNormal Properties

---
The VertexStreamPositionNormal type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from VertexStream)
Top
#### Reference
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace